{"year":"2020","slug":"hello-world","title":"Hello world!","date":"26-08-2020","html":"<h1 id=\"markdown-quick-reference\">Markdown Quick Reference</h1>\n<p>This guide is a very brief overview, with examples, of the syntax that <a href=\"http://daringfireball.net/projects/markdown/\">Markdown</a> supports. It is itself written in Markdown and you can copy the samples over to the left-hand pane for experimentation. It&#39;s shown as <em>text</em> and not <em>rendered HTML</em>.</p>\n<h1 id=\"simple-text-formatting\">Simple Text Formatting</h1>\n<p>First thing is first. You can use <em>stars</em> or <em>underscores</em> for italics. <strong>Double stars</strong> and <strong>double underscores</strong> for bold. <strong><em>Three together</em></strong> for <strong><em>both</em></strong>.</p>\n<p>Paragraphs are pretty easy too. Just have a blank line between chunks of text.</p>\n<blockquote>\n<p>This chunk of text is in a block quote. Its multiple lines will all be\nindented a bit from the rest of the text.</p>\n<blockquote>\n<p>Multiple levels of block quotes also work.</p>\n</blockquote>\n</blockquote>\n<p>Sometimes you want to include code, such as when you are explaining how <code>&lt;h1&gt;</code> HTML tags work, or maybe you are a programmer and you are discussing <code>someMethod()</code>.</p>\n<p>If you want to include code and have new\nlines preserved, indent the line with a tab\nor at least four spaces:</p>\n<pre><code>Extra spaces work here too.\nThis is also called preformatted text and it is useful for showing examples.\nThe text will stay as text, so any *markdown* or &lt;u&gt;HTML&lt;/u&gt; you add will\nnot show up formatted. This way you can show markdown examples in a\nmarkdown document.</code></pre>\n<blockquote>\n<pre><code>You can also use preformatted text with your blockquotes\nas long as you add at least five spaces.</code></pre>\n</blockquote>\n<h1 id=\"headings\">Headings</h1>\n<p>There are a couple of ways to make headings. Using three or more equals signs on a line under a heading makes it into an &quot;h1&quot; style. Three or more hyphens under a line makes it &quot;h2&quot; (slightly smaller). You can also use multiple pound symbols (<code>#</code>) before and after a heading. Pounds after the title are ignored. Here are some examples:</p>\n<h1 id=\"this-is-h1\">This is H1</h1>\n<h2 id=\"this-is-h2\">This is H2</h2>\n<h1 id=\"this-is-h1-1\">This is H1</h1>\n<h2 id=\"this-is-h2-1\">This is H2</h2>\n<h3 id=\"this-is-h3-with-some-extra-pounds\">This is H3 with some extra pounds</h3>\n<h4 id=\"you-get-the-idea\">You get the idea</h4>\n<h5 id=\"i-dont-need-extra-pounds-at-the-end\">I don&#39;t need extra pounds at the end</h5>\n<h6 id=\"h6-is-the-max\">H6 is the max</h6>\n<h1 id=\"links\">Links</h1>\n<p>Let&#39;s link to a few sites. First, let&#39;s use the bare URL, like <a href=\"https://www.github.com\">https://www.github.com</a>. Great for text, but ugly for HTML.\nNext is an inline link to <a href=\"https://www.google.com\">Google</a>. A little nicer.\nThis is a reference-style link to [Wikipedia] <a href=\"https://www.wikipedia.org\">1</a>.\nLastly, here&#39;s a pretty link to <a href=\"https://www.yahoo.com\">Yahoo</a>. The reference-style and pretty links both automatically use the links defined below, but they could be defined <em>anywhere</em> in the markdown and are removed from the HTML. The names are also case insensitive, so you can use <a href=\"https://www.yahoo.com\">YaHoO</a> and have it link properly.</p>\n<p>Title attributes may be added to links by adding text after a link.\nThis is the <a href=\"https://www.bing.com\" title=\"Bing\">inline link</a> with a &quot;Bing&quot; title.\nYou can also go to [W3C] <a href=\"https://w3c.org\" title=\"The W3C puts out specs for web-based things\">2</a> and maybe visit a <a href=\"https://facebook.com\" title=\"Facebook!\">friend</a>.</p>\n<p>Email addresses in plain text are not linked: <a href=\"mailto:&#116;&#101;&#x73;&#x74;&#x40;&#x65;&#120;&#x61;&#x6d;&#x70;&#x6c;&#x65;&#46;&#x63;&#x6f;&#109;\">&#116;&#101;&#x73;&#x74;&#x40;&#x65;&#120;&#x61;&#x6d;&#x70;&#x6c;&#x65;&#46;&#x63;&#x6f;&#109;</a>.\nEmail addresses wrapped in angle brackets are linked: <a href=\"mailto:&#116;&#x65;&#x73;&#116;&#64;&#101;&#120;&#x61;&#x6d;&#112;&#x6c;&#101;&#46;&#x63;&#x6f;&#109;\">&#116;&#x65;&#x73;&#116;&#64;&#101;&#120;&#x61;&#x6d;&#112;&#x6c;&#101;&#46;&#x63;&#x6f;&#109;</a>.\nThey are also obfuscated so that email harvesting spam robots hopefully won&#39;t get them.</p>\n<h1 id=\"lists\">Lists</h1>\n<ul>\n<li>This is a bulleted list</li>\n<li>Great for shopping lists</li>\n<li>You can also use hyphens</li>\n<li>Or plus symbols</li>\n</ul>\n<p>The above is an &quot;unordered&quot; list. Now, on for a bit of order.</p>\n<ol>\n<li>Numbered lists are also easy</li>\n<li>Just start with a number</li>\n<li>However, the actual number doesn&#39;t matter when converted to HTML.</li>\n<li>This will still show up as 4.</li>\n</ol>\n<p>You might want a few advanced lists:</p>\n<ul>\n<li><p>This top-level list is wrapped in paragraph tags</p>\n</li>\n<li><p>This generates an extra space between each top-level item.</p>\n</li>\n<li><p>You do it by adding a blank line</p>\n</li>\n<li><p>This nested list also has blank lines between the list items.</p>\n</li>\n<li><p>How to create nested lists</p>\n<ol>\n<li>Start your regular list</li>\n<li>Indent nested lists with two spaces</li>\n<li>Further nesting means you should indent with two more spaces<ul>\n<li>This line is indented with four spaces.</li>\n</ul>\n</li>\n</ol>\n</li>\n<li><p>List items can be quite lengthy. You can keep typing and either continue\nthem on the next line with no indentation.</p>\n</li>\n<li><p>Alternately, if that looks ugly, you can also\nindent the next line a bit for a prettier look.</p>\n</li>\n<li><p>You can put large blocks of text in your list by just indenting with two spaces.</p>\n<p>This is formatted the same as code, but you can inspect the HTML\nand find that it&#39;s just wrapped in a <code>&lt;p&gt;</code> tag and <em>won&#39;t</em> be shown\nas preformatted text.</p>\n<p>You can keep adding more and more paragraphs to a single\nlist item by adding the traditional blank line and then keep\non indenting the paragraphs with two spaces.</p>\n<p>You really only need to indent the first line,\nbut that looks ugly.</p>\n</li>\n<li><p>Lists support blockquotes</p>\n<blockquote>\n<p>Just like this example here. By the way, you can\nnest lists inside blockquotes!</p>\n<ul>\n<li>Fantastic!</li>\n</ul>\n</blockquote>\n</li>\n<li><p>Lists support preformatted text</p>\n<pre><code>You just need to indent an additional four spaces.</code></pre>\n</li>\n</ul>\n<h1 id=\"even-more\">Even More</h1>\n<h2 id=\"horizontal-rule\">Horizontal Rule</h2>\n<p>If you need a horizontal rule you just need to put at least three hyphens, asterisks, or underscores on a line by themselves. You can also even put spaces between the characters.</p>\n<hr>\n<hr>\n<hr>\n<p>Those three all produced horizontal lines. Keep in mind that three hyphens under any text turns that text into a heading, so add a blank like if you use hyphens.</p>\n<h2 id=\"images\">Images</h2>\n<p>Images work exactly like links, but they have exclamation points in front. They work with references and titles too.</p>\n<p><img src=\"https://www.google.com/images/errors/logo_sm.gif\" alt=\"Google Logo\"> and <img src=\"https://wpclipart.com/smiley/happy/simple_colors/smiley_face_simple_green_small.png\" alt=\"Happy\" title=\"&quot;Smiley face&quot;\">.</p>\n<pre><code>&lt;?php echo &#39;Hello world!&#39;; ?&gt;</code></pre>\n<h2 id=\"inline-html\">Inline HTML</h2>\n<p>If markdown is too limiting, you can just insert your own <strike>crazy</strike> HTML. Span-level HTML <u>can <em>still</em> use markdown</u>. Block level elements must be separated from text by a blank line and must not have any spaces before the opening and closing HTML.</p>\n<div style='font-family: \"Comic Sans MS\", \"Comic Sans\", cursive;'>\nIt is a pity, but markdown does **not** work in here for most markdown parsers.\n[Marked] handles it pretty well.\n</div>\n"}